<?php
// +------------------------------------------------+
// |http://www.cjango.com                           |
// +------------------------------------------------+
// | 修复BUG不是一朝一夕的事情，等我喝醉了再说吧！  |
// +------------------------------------------------+
// | Author: 小陈叔叔 <Jason.Chen>                  |
// +------------------------------------------------+

// 绕过微信域名文件认证
\think\Route::rule('MP_verify_<code>', function ($code) {
    exit($code);
}, 'GET', ['ext' => 'txt']);

return [
    // TOKEN
    'token'  => '',
    // APPID
    'appid'  => '',
    // 密钥
    'secret' => '',
    // 数据传输加密密钥
    'AESKey' => '',
    // 商户ID
    'mch_id' => '',
    // 支付密钥
    'paykey' => '',
    // PEM 文件路径
    'pem'    => [
        'cert' => '',
        'key'  => '',
    ],
];
